#### <font color="#03997A"> Diplomado en Ciencia de datos UNAM </font>
##### <font color="#03997A"> Mto: Getsemani Ruben Castro Villanueva </font>
##### <font color="#03997A"> Modulo 5 Manipulación de datos en Python</font>
##### <font color="#03997A">Practica 6 Alumno: Ibarra Ramírez Sergio  </font>

Vamos a importar el set de datos

In [4]:
import seaborn as sns 

taxis = sns.load_dataset('taxis')

taxis.head()

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough
0,2019-03-23 20:21:09,2019-03-23 20:27:24,1,1.60,7.0,2.15,0.0,12.95,yellow,credit card,Lenox Hill West,UN/Turtle Bay South,Manhattan,Manhattan
1,2019-03-04 16:11:55,2019-03-04 16:19:00,1,0.79,5.0,0.00,0.0,9.30,yellow,cash,Upper West Side South,Upper West Side South,Manhattan,Manhattan
2,2019-03-27 17:53:01,2019-03-27 18:00:25,1,1.37,7.5,2.36,0.0,14.16,yellow,credit card,Alphabet City,West Village,Manhattan,Manhattan
3,2019-03-10 01:23:59,2019-03-10 01:49:51,1,7.70,27.0,6.15,0.0,36.95,yellow,credit card,Hudson Sq,Yorkville West,Manhattan,Manhattan
4,2019-03-30 13:27:42,2019-03-30 13:37:14,3,2.16,9.0,1.10,0.0,13.40,yellow,credit card,Midtown East,Yorkville West,Manhattan,Manhattan

In [10]:
taxis.shape

(6433, 14)

In [5]:
## Para listar las variables que contiene 
variables_taxis = taxis.columns
variables_taxis

Index(['pickup', 'dropoff', 'passengers', 'distance', 'fare', 'tip', 'tolls',
       'total', 'color', 'payment', 'pickup_zone', 'dropoff_zone',
       'pickup_borough', 'dropoff_borough'],
      dtype='object')

In [12]:
### Monto toal por medio de pago
taxis.groupby(['payment']).agg(monto_total=('total','sum'))

             monto_total
payment
cash            26594.45
credit card     91866.10

In [13]:
### Propina maxima que se dió  en tarjeta de crédito 


taxis.groupby(['payment']).agg(propina_cantidad=('tip','sum'))

             propina_cantidad
payment
cash                     0.00
credit card          12732.32

In [14]:
### Propina maxima que se dió  en tarjeta de crédito 


taxis.groupby(['payment']).agg(propina_maxima=('tip','max')
                               ,propina_minima=('tip','min')
                               ,propina_promedio=('tip','mean'))

             propina_maxima  propina_minima  propina_promedio
payment
cash                    0.0             0.0          0.000000
credit card            33.2             0.0          2.781805

La propina maxima fue de 33.2 Unidades monetarias

In [15]:
### En los viajes a Manhatan, en promedio cuantos pasajareos viajaban en la unidad 

taxis.groupby(['dropoff_borough']).agg(passenger_maxima=('passengers','max')
                               ,passenger_minima=('passengers','min')
                               ,passenger_promedio=('passengers','mean'))

                 passenger_maxima  passenger_minima  passenger_promedio
dropoff_borough
Bronx                           5                 1            1.291971
Brooklyn                        6                 0            1.381238
Manhattan                       6                 0            1.564733
Queens                          6                 0            1.518450
Staten Island                   1                 1            1.000000

En promedio iban 1.56 pasajeros

In [16]:
## ¿Cuantos pasajeros iban en el viaje en el cual se reocrripo la mayor distancia?


taxis.groupby(['passengers']).agg(dist_maxima=('distance','max')
                               ,dist_min=('distance','min')
                               ,dist_mean=('distance','mean'))

            dist_maxima  dist_min  dist_mean
passengers
0                 21.10      0.00   2.960417
1                 36.66      0.00   3.019245
2                 36.70      0.00   2.978596
3                 19.62      0.00   3.135844
4                 19.16      0.20   2.936455
5                 21.51      0.28   2.964188
6                 33.76      0.00   3.488758

Iban 2 pasajeros y fue de 33.66 unidades de distancia

In [17]:
# Costo promedio, maximo de propina y el max de pasajeros por distrito de abordaje y color de taxi 

taxis.groupby(['pickup_borough','color' ]).agg(cost_mean=('fare','mean')
                               ,tip_max=('tip','max')
                               ,passengers_max=('passengers','max'))

                       cost_mean  tip_max  passengers_max
pickup_borough color
Bronx          green   20.470241     8.39               5
               yellow  23.742500     0.00               3
Brooklyn       green   16.048243     7.70               6
               yellow  18.634000     6.35               6
Manhattan      green   10.583673    10.71               5
               yellow  11.186534    20.56               6
Queens         green   13.635139     9.51               6
               yellow  33.753767    23.19               6